; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v4 ?v9)
             (pred_6 ?v6 ?v8)
             (pred_1 ?v4 ?v8)
             (pred_11 ?v10 ?v4 )
	     (pred_12 ?v4)
             (pred_8 ?v5)
             (pred_2 ?v6)
             (pred_4 ?v8)
             (pred_3 ?v4)
             (pred_9 ?v6)
             (pred_10 ?v4)
             (pred_7 ))



(:action op_3
:parameters (?v12 ?v2 ?v1 ?v3)
:precondition (and (pred_8 ?v12) (pred_8 ?v2) (pred_2 ?v1) (pred_4 ?v3)
          (pred_5 ?v12 ?v2) (pred_6 ?v1 ?v3)
                   (pred_1 ?v2 ?v3) (pred_12 ?v12) 
                   (pred_3 ?v2) (pred_9 ?v1))
:effect (and  (pred_10 ?v2) (not (pred_3 ?v2))))


(:action op_1
:parameters (?v12 ?v7)
:precondition (and (pred_8 ?v12) (pred_8 ?v7)
               (pred_12 ?v12) (pred_5 ?v12 ?v7) (pred_10 ?v7))
:effect (and (pred_12 ?v7) (not (pred_12 ?v12))))

(:action op_5
:parameters (?v12 ?v1)
:precondition (and (pred_8 ?v12) (pred_2 ?v1) 
                  (pred_12 ?v12) (pred_11 ?v1 ?v12) (pred_7 ))
:effect (and (pred_9 ?v1)
   (not (pred_11 ?v1 ?v12)) (not (pred_7 ))))


(:action op_4
:parameters (?v12 ?v13 ?v11)
:precondition (and (pred_8 ?v12) (pred_2 ?v13) (pred_2 ?v11)
                  (pred_12 ?v12) (pred_9 ?v11) (pred_11 ?v13 ?v12))
:effect (and (pred_9 ?v13) (pred_11 ?v11 ?v12)
        (not (pred_9 ?v11)) (not (pred_11 ?v13 ?v12))))

(:action op_2
:parameters (?v12 ?v1)
:precondition (and (pred_8 ?v12) (pred_2 ?v1) 
                  (pred_12 ?v12) (pred_9 ?v1))
:effect (and (pred_7 ) (pred_11 ?v1 ?v12) (not (pred_9 ?v1)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_14 obj_16 obj_06 obj_13 obj_19 obj_20 obj_04 obj_03 obj_05 obj_15 obj_09 obj_11 obj_02 obj_08 obj_10 obj_01
    obj_17 obj_12
    obj_18 obj_07
    )

    (:init
       (pred_7)

       (pred_8 obj_14)
       (pred_8 obj_16)
       (pred_8 obj_06)
       (pred_8 obj_13)
       (pred_8 obj_19)
       (pred_8 obj_20)
       (pred_8 obj_04)
       (pred_8 obj_03)
       (pred_8 obj_05)
       (pred_8 obj_15)
       (pred_8 obj_09)
       (pred_8 obj_11)
       (pred_8 obj_02)
       (pred_8 obj_08)
       (pred_8 obj_10)
       (pred_8 obj_01)
       (pred_4 obj_17)
       (pred_4 obj_12)
       (pred_2 obj_18)
       (pred_2 obj_07)

       (pred_5 obj_14 obj_19)
       (pred_5 obj_14 obj_16)
       (pred_5 obj_16 obj_20)
       (pred_5 obj_16 obj_06)
       (pred_5 obj_16 obj_14)
       (pred_5 obj_06 obj_04)
       (pred_5 obj_06 obj_13)
       (pred_5 obj_06 obj_16)
       (pred_5 obj_13 obj_03)
       (pred_5 obj_13 obj_06)
       (pred_5 obj_19 obj_05)
       (pred_5 obj_19 obj_20)
       (pred_5 obj_19 obj_14)
       (pred_5 obj_20 obj_15)
       (pred_5 obj_20 obj_04)
       (pred_5 obj_20 obj_16)
       (pred_5 obj_20 obj_19)
       (pred_5 obj_04 obj_09)
       (pred_5 obj_04 obj_03)
       (pred_5 obj_04 obj_06)
       (pred_5 obj_04 obj_20)
       (pred_5 obj_03 obj_11)
       (pred_5 obj_03 obj_13)
       (pred_5 obj_03 obj_04)
       (pred_5 obj_05 obj_02)
       (pred_5 obj_05 obj_15)
       (pred_5 obj_05 obj_19)
       (pred_5 obj_15 obj_08)
       (pred_5 obj_15 obj_09)
       (pred_5 obj_15 obj_20)
       (pred_5 obj_15 obj_05)
       (pred_5 obj_09 obj_10)
       (pred_5 obj_09 obj_11)
       (pred_5 obj_09 obj_04)
       (pred_5 obj_09 obj_15)
       (pred_5 obj_11 obj_01)
       (pred_5 obj_11 obj_03)
       (pred_5 obj_11 obj_09)
       (pred_5 obj_02 obj_08)
       (pred_5 obj_02 obj_05)
       (pred_5 obj_08 obj_10)
       (pred_5 obj_08 obj_15)
       (pred_5 obj_08 obj_02)
       (pred_5 obj_10 obj_01)
       (pred_5 obj_10 obj_09)
       (pred_5 obj_10 obj_08)
       (pred_5 obj_01 obj_11)
       (pred_5 obj_01 obj_10)
       (pred_3 obj_16)
       (pred_3 obj_06)
       (pred_1  obj_16 obj_17)
       (pred_1  obj_06 obj_12)
       (pred_10 obj_14)
       (pred_10 obj_13)
       (pred_10 obj_19)
       (pred_10 obj_20)
       (pred_10 obj_04)
       (pred_10 obj_03)
       (pred_10 obj_05)
       (pred_10 obj_15)
       (pred_10 obj_09)
       (pred_10 obj_11)
       (pred_10 obj_02)
       (pred_10 obj_08)
       (pred_10 obj_10)
       (pred_10 obj_01)

       (pred_6  obj_18 obj_17)
       (pred_6  obj_07 obj_12)
       (pred_11 obj_18 obj_08)
       (pred_11 obj_07 obj_01)
       (pred_12 obj_10)
    )

    (:goal (and
       (pred_11 obj_18 obj_16)
    ))
(:constraints
  (always (not (pred_12 obj_20)))
)
)

; plan
1. (op_1 obj_10 obj_08)
   deleted: (pred_12 obj_10)
   added: (pred_12 obj_08)
   goals met: 0 of 1
2. (op_5 obj_08 obj_18)
   deleted: (pred_11 obj_18 obj_08) (pred_7)
   added: (pred_9 obj_18)
   goals met: 0 of 1
3. (op_1 obj_08 obj_15)
   deleted: (pred_12 obj_08)
   added: (pred_12 obj_15)
   goals met: 0 of 1
4. (op_1 obj_15 obj_05)
   deleted: (pred_12 obj_15)
   added: (pred_12 obj_05)
   goals met: 0 of 1
5. (op_1 obj_05 obj_19)
   deleted: (pred_12 obj_05)
   added: (pred_12 obj_19)
   goals met: 0 of 1
6. (op_1 obj_19 obj_14)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_14)
   goals met: 0 of 1
7. (op_3 obj_14 obj_16 obj_18 obj_17)
   deleted: (pred_3 obj_16)
   added: (pred_10 obj_16)
   goals met: 0 of 1
8. (op_1 obj_14 obj_16)
   deleted: (pred_12 obj_14)
   added: (pred_12 obj_16)
   goals met: 0 of 1
9. (op_2 obj_16 obj_18)
   deleted: (pred_9 obj_18)
   added: (pred_7) (pred_11 obj_18 obj_16)
   goals met: 1 of 1
